# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige werkcollege de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [2]:
import pandas as pd
import sqlite3
import warnings
warnings.simplefilter('ignore')

Zet de volgende bestanden in een makkelijk te vinden map, als je dat nog niet gedaan hebt:
- go_sales.sqlite
- go_crm.sqlite
- go_staff.sqlite

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige werkcollege de code om een connectie met het bestand go_sales.sqlite te maken.

In [8]:
conn = sqlite3.connect("./go_sales.sqlite")

Lees van de ingelezen go_sales-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [11]:
select_all_product = "SELECT * FROM product"
select_all_product_type = "SELECT * FROM product_type"
select_all_product_line = "SELECT * FROM product_line"
select_all_sales_staff = "SELECT * FROM sales_staff"
select_all_sales_branch = "SELECT * FROM sales_branch"
select_all_retailer_site = "SELECT * FROM retailer_site"
select_all_country = "SELECT * FROM country"
select_all_order_header = "SELECT * FROM order_header"
select_all_order_details = "SELECT * FROM order_details"
select_all_returned_item = "SELECT * FROM returned_item"
select_all_return_reason = "SELECT * FROM return_reason"

#tabel: product
product = pd.read_sql(select_all_product, conn)
product

#tabel: product_type.
#product_type = pd.read_sql(select_all_product_type, conn)
#product_type

#tabel: product_line
#product_line = pd.read_sql(select_all_product_line, conn)
#product_line

#tabel: sales_staff
#sales_staff = pd.read_sql(select_all_sales_staff, conn)
#sales_staff

#tabel: sales_branch
#sales_branch = pd.read_sql(select_all_sales_branch, conn)
#sales_branch

#tabel: retailer_site
#retailer_site = pd.read_sql(select_all_retailer_site, conn)
#retailer_site

#tabel: country
#country = pd.read_sql(select_all_country, conn)
#country

#tabel: order_header
#order_header = pd.read_sql(select_all_order_header, conn)
#order_header

#tabel: order_details
#order_details = pd.read_sql(select_all_order_details, conn)
#order_details

#tabel: returned_item
#returned_item = pd.read_sql(select_all_returned_item, conn)
#returned_item

#tabel: return_reason
#return_reason = pd.read_sql(select_all_return_reason, conn)
#return_reason

,PRODUCT_NUMBER,INTRODUCTION_DATE,PRODUCT_TYPE_CODE,PRODUCTION_COST,MARGIN,PRODUCT_IMAGE,LANGUAGE,PRODUCT_NAME,DESCRIPTION
0,1,1995-02-15,1,4.00,0.33,P01CE1CG1.jpg,EN,TrailChef Water Bag,"Lightweight, collapsible bag to carry liquids ..."
1,2,1995-02-15,1,9.22,0.23,P02CE1CG1.jpg,EN,TrailChef Canteen,Aluminum canteen. Rugged fleece-lined cover wi...
2,3,1995-02-15,1,15.93,0.28,P03CE1CG1.jpg,EN,TrailChef Kitchen Kit,"Zippered nylon pouch contains cutlery for two,..."
3,4,1995-02-15,1,5.00,0.28,P04CE1CG1.jpg,EN,TrailChef Cup,Tin cup. Holds 0.4 liters. Weight: 60 g
4,5,1995-02-15,1,34.97,0.30,P05CE1CG1.jpg,EN,TrailChef Cook Set,All you will ever need on the trail. Pot grip...
...,...,...,...,...,...,...,...,...,...
110,111,2003-12-15,20,81.80,0.55,P111GE5PT20.jpg,EN,Blue Steel Max Putter,Putter head is composed from a single piece of...
111,112,2004-01-10,21,6.00,0.33,P112GE5GA21.jpg,EN,Course Pro Golf and Tee Set,Set includes two premium golf ball and an asso...
112,113,2004-01-15,21,6.00,0.50,P113GE5GA21.jpg,EN,Course Pro Umbrella,Large red and white patterned golf umbrella.
113,114,2003-12-15,21,80.00,0.60,P114GE5GA21.jpg,EN,Course Pro Golf Bag,High quality golf bag that includes carrying s...
114,115,2003-12-27,21,5.00,0.50,P115GE5GA21.jpg,EN,Course Pro Gloves,Durable nylon constructed gloves with stitched...

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt.<br> <u>Let op:</u> lees eventueel de informatie uit het vorige werkcollege nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [ ]:
sql_query = "SELECT * FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
pd.read_sql(sql_query, conn)
#Op de puntjes hoort de connectie naar go_sales óf go_staff óf go_crm te staan.

,type,name,tbl_name,rootpage,sql
0,table,country,country,480,"CREATE TABLE ""country"" (\n\t""COUNTRY_CODE""\tIN..."
1,table,order_details,order_details,11,"CREATE TABLE ""order_details"" (\n\t""ORDER_DETAI..."
2,table,order_header,order_header,24,"CREATE TABLE ""order_header"" (\n\t""ORDER_NUMBER..."
3,table,order_method,order_method,27,"CREATE TABLE ""order_method"" (\n\t""ORDER_METHOD..."
4,table,product,product,28,"CREATE TABLE ""product"" (\n\t""PRODUCT_NUMBER""\t..."
5,table,product_line,product_line,17,"CREATE TABLE ""product_line"" (\n\t""PRODUCT_LINE..."
6,table,product_type,product_type,10,"CREATE TABLE ""product_type"" (\n\t""PRODUCT_TYPE..."
7,table,retailer_site,retailer_site,18,"CREATE TABLE ""retailer_site"" (\n\t""RETAILER_SI..."
8,table,return_reason,return_reason,30,"CREATE TABLE ""return_reason"" (\n\t""RETURN_REAS..."
9,table,returned_item,returned_item,31,"CREATE TABLE ""returned_item"" (\n\t""RETURN_CODE..."
10,table,sales_branch,sales_branch,2,"CREATE TABLE ""sales_branch"" (\n\t""SALES_BRANCH..."
11,table,sales_staff,sales_staff,3,"CREATE TABLE ""sales_staff"" (\n\t""SALES_STAFF_C..."

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [33]:
#1. Lees het dataFrame in
#2. We willen alles selecteren van deze tabel.
#3. We maken een boolean aan en kijken in de kolom 'PRODUCT_COST' 
#4. Waarin we productiekosten < 100 & > 50 willen projecteren op het scherm

product = pd.read_sql_query(select_all_product, conn)

product_kosten_hoger_lager = ((product['PRODUCTION_COST'] > 50) & (product['PRODUCTION_COST'] < 100))

product.loc[(product_kosten_hoger_lager), ['PRODUCT_NAME', 'PRODUCTION_COST']]

                        PRODUCT_NAME  PRODUCTION_COST
5          TrailChef Deluxe Cook Set            85.11
7             TrailChef Double Flame            75.00
16                   Hibernator Lite            60.00
17                        Hibernator            86.00
19   Hibernator Self - Inflating Mat            78.55
22               Hibernator Camp Cot            65.33
23      Canyon Mule Climber Backpack            62.50
45           Granite Climbing Helmet            52.86
47             Husky Harness Extreme            55.00
57                    Granite Hammer            57.13
68                         Polar Ice            73.33
69                      Polar Sports            80.00
70                        Polar Wave            60.00
71                     Polar Extreme            72.50
74                      Edge Extreme            80.00
77                         Seeker 35            79.19
78                         Seeker 50            92.58
79                    Seeker Extreme            94.12
82                    Glacier Deluxe            56.25
83                       Glacier GPS            78.55
109                Blue Steel Putter            60.00
110            Blue Steel Max Putter            81.80
113              Course Pro Golf Bag            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [40]:
#1. Lees de query in om een variabele te maken
#2. Maak een boolean waar marge < 20% of hoger dan 60%
#3. gebruik .loc[(boolean), ['kolommen']]

product = pd.read_sql(select_all_product, conn)

marge_hoger_lager = ((product['MARGIN'] < 0.2)) | ((product['MARGIN'] > 0.6))

product.loc[marge_hoger_lager, ['PRODUCT_NAME', 'MARGIN']]

                    PRODUCT_NAME  MARGIN
20                Hibernator Pad    0.17
23  Canyon Mule Climber Backpack    0.17
85             BugShield Natural    0.67
86               BugShield Spray    0.67
87         BugShield Lotion Lite    0.70
88              BugShield Lotion    0.63
89             BugShield Extreme    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [ ]:
#1. Lees de query om een variabele te maken
#2. Ik neem aan de we het tabel land gaan inlezen
#3. Maak een boolean met == 'francs'
#4. variabele.loq[bool, [kolom]]

land = pd.read_sql(select_all_country, conn)

land_betaald_met_francs = ((land['CURRENCY_NAME']) == 'francs')

land.loc[land_betaald_met_francs, ['COUNTRY']]

        COUNTRY
0        France
7   Switzerland
15      Belgium

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [ ]:
# Lees de query om een variabele aan te maken
# Maak een boolean waarin je marge met meer dan 50% selecteert.
# Kolommen 'INTRODUCTION_DATE' en 'MARGIN'
# Sinds we verschillende waardes willen moeten we drop_duplicates gebruiken

product = pd.read_sql(select_all_product, conn)

marge_meer_dan_vijftig = ((product['MARGIN']) > 0.5)

product.loc[marge_meer_dan_vijftig, ['INTRODUCTION_DATE']].drop_duplicates('INTRODUCTION_DATE')

    INTRODUCTION_DATE
66         2000-10-26
85         1995-02-15
101        2003-12-10
103        2003-12-18
104        2003-12-27
106        2004-01-13
110        2003-12-15

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [ ]:
# Lees de query om een variabele aan te maken
# Welk tabel? sales_branch
# Welk kolommen heb je nodig?  ADRESS1, ADRESS2, REGION, CITY
# Maak een boolean waarin ADRESS2 != NaN en REGION NaN
# Dit doen we met notna()

salesbranch = pd.read_sql(select_all_sales_branch, conn)

alle_adressen_bekend = ((salesbranch['ADDRESS2'].notna()) & (salesbranch['REGION'].notna()))

salesbranch.loc[alle_adressen_bekend, ['ADDRESS1', 'CITY']]

                            ADDRESS1              CITY
2                Singelgravenplein 4         Amsterdam
13  Prol. Paseo de la Reforma No. 51  Distrito Federal
14               202-2-3 Hyakunincho             Tokyo
15                     543-225 Asahi        Osaka City
16                  2315 Queen's Ave         Melbourne
18             Avenida Paulista, 333         São Paulo
24                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [ ]:
#Lees de query om een variabele aan te maken
# Welk tabel hebben we nodig? #country
# Welke kolommen hebben we nodig? #CURRENCY_NAME #COUNTRY
# Maak een boolean waar de landen met dollars of new dollar betalen.
# Sorteer de uitkomst op land. .sort_values

country = pd.read_sql(select_all_country, conn)

country_dollar_new_dollar = ((country['CURRENCY_NAME'] == 'dollars') | (country['CURRENCY_NAME'] == 'new dollar'))

country.loc[country_dollar_new_dollar, ['COUNTRY']].sort_values('COUNTRY')

          COUNTRY
14      Australia
3          Canada
11         Taiwan
2   United States

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [16]:
# Lees de query.
# Welk tabel? Retailer_Site? 
# Welke kolommen? ADDRESS1, ADDRESS2, CITY, POSTAL_ZONE
# Maak een boolean postcode begint met 'd' filter op vestiging die twee adressen hebben.
# Uitkomst, beide adressen en de stad.

vestiging = pd.read_sql(select_all_retailer_site, conn)

postcode_begint_met_d = ( (vestiging['ADDRESS1'].notna()) & (vestiging['ADDRESS2'].notna()) & (vestiging['POSTAL_ZONE'].str[0] == 'D') )

vestiging.loc[postcode_begint_met_d, ['ADDRESS1', 'ADDRESS2', 'CITY']]

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [28]:
# Lees de query
# Welk tabel? returned_item
# COUNT het totaal aantal producten dat is teruggebracht.
# Hoe ? count(), hoe krijg ik één waarde terug? denk door één kolom uittelezen
# Uitkomst totaal aantal producten

producten = pd.read_sql(select_all_returned_item, conn)

totaal_aantal_producten = ( (producten['RETURN_CODE'].count()) )
totaal_aantal_producten

np.int64(619)

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [10]:
# Lees de query in 
# Welk tabel? retailer_site
# Welke kolommen? REGION
# Maak een boolean waarin staat dat een regio notna is.
# var = bool['...'].count
# Uitkomst in 1 waarde

retailer_sites = pd.read_sql(select_all_retailer_site, conn)

not_null_regios = ( (retailer_sites['REGION'].nunique()) )

not_null_regios

110

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [ ]:
# Lees de query in
# import numpy as np?
# Welke tabel? product
# Welke kolommen? MARGIN
# Maak een boolean met de laagste
# Maak een boolean met de hoogste
# Maak een boolean met het gemiddelde.
# Zet die om in een data frame.

product = pd.read_sql_query(select_all_product, conn)

laagste_margin = ((product['MARGIN'].min()))

hoogste_margin = ((product['MARGIN'].max()))

gemiddelde_margin = round(product['MARGIN'].mean(), 2)

resultaat = pd.DataFrame({'Laagste_marge' : [laagste_margin], 'Hoogste_marge' : [hoogste_margin], 'Gemiddelde_marge' : [gemiddelde_margin]})

resultaat

   Laagste_marge  Hoogste_marge  Gemiddelde_marge
0           0.17            0.7               0.4

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (6 kolommen, 10 rijen)

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [2]:
from datetime import date
date.today().year

2026

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [3]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 30 jaar in dienst) of een ‘lang in dienst’ (groter dan gelijk aan 30 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)